FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
#define LED_GREEN         0
#define LED_AMBER         1
#define LED_BLUE          2
#define LED_RED           3

/*! List of all LEDs definitions. */
#define PINS_LEDS         PIN_USER_LED1, PIN_USER_LED2, PIN_USER_LED3, PIN_POWER_LED

/*! LED #0 pin definition (BLUE). */
#define LED_0_NAME        "blue LED D2"
#define LED0_GPIO         ( PIO_PA12_IDX )
#define LED0_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

#define PIN_LED_0         { 1 << 12, PIOA, ID_PIOA, PIO_OUTPUT_0, PIO_DEFAULT }
#define PIN_LED_0_MASK    ( 1 << 12 )
#define PIN_LED_0_PIO     PIOA
#define PIN_LED_0_ID      ID_PIOA
#define PIN_LED_0_TYPE    PIO_OUTPUT_0
#define PIN_LED_0_ATTR    PIO_DEFAULT

/*! LED #1 pin definition (GREEN). */
#define LED_1_NAME        "green LED D4"
#define LED1_GPIO         ( PIO_PB13_IDX )
#define LED1_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

#define PIN_LED_1         { 1 << 13, PIOB, ID_PIOB, PIO_OUTPUT_1, PIO_DEFAULT }
#define PIN_LED_1_MASK    ( 1 << 13 )
#define PIN_LED_1_PIO     PIOB
#define PIN_LED_1_ID      ID_PIOB
#define PIN_LED_1_TYPE    PIO_OUTPUT_1
#define PIN_LED_1_ATTR    PIO_DEFAULT

/*! LED #2 pin detection (AMBER). */
#define LED2_GPIO         ( PIO_PB12_IDX )
#define LED2_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

/*! LED #3 pin detection (power) */
#define LED3_GPIO         ( PIO_PA13_IDX )
#define LED3_FLAGS        ( PIO_TYPE_PIO_OUTPUT_0 | PIO_DEFAULT )

/**
 * \file
 * Push buttons
 * - \ref PIN_PB_LEFT_CLICK
 * - \ref PIN_PB_RIGHT_CLICK
 * - \ref PINS_PUSHBUTTONS
 * - \ref PUSHBUTTON_BP1
 * - \ref PUSHBUTTON_BP2
 *
 */

/* ------------------------------------------------------------------------ */
/* PUSHBUTTONS                                                              */
/* ------------------------------------------------------------------------ */

/** Push button LEFT CLICK definition.
 *  Attributes = pull-up + debounce + interrupt on falling edge. */
#define PIN_PB_LEFT_CLICK                \
    { PIO_PE7, PIOE, ID_PIOE, PIO_INPUT, \
      PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE }

/** Push button RIGHT CLICK definition.
 *  Attributes = pull-up + debounce + interrupt on falling edge. */
#define PIN_PB_RIGHT_CLICK                \
    { PIO_PB23, PIOB, ID_PIOB, PIO_INPUT, \
      PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE }

/*! List of all push button definitions. */
#define PINS_PUSHBUTTONS      PIN_PB_LEFT_CLICK, PIN_PB_RIGHT_CLICK

/*! Push button #1 index. */
#define PUSHBUTTON_BP1        0
/*! Push button #2 index. */
#define PUSHBUTTON_BP2        1

/*! Push button LEFT CLICK index. */
#define PUSHBUTTON_LEFT       0
/*! Push button RIGHT CLICK index. */
#define PUSHBUTTON_RIGHT      1

/** Push button #0 definition.
 *  Attributes = pull-up + debounce + interrupt on rising edge. */
#define PUSHBUTTON_1_NAME     "LEFT CLICK"
#define GPIO_PUSH_BUTTON_1    ( PIO_PE7_IDX )
#define GPIO_PUSH_BUTTON_1_FLAGS \
    ( PIO_INPUT | PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_RISE_EDGE )

#define PIN_PUSHBUTTON_1                 \
    { PIO_PE7, PIOE, ID_PIOE, PIO_INPUT, \
      PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE }
#define PIN_PUSHBUTTON_1_MASK    PIO_PE7
#define PIN_PUSHBUTTON_1_PIO     PIOE
#define PIN_PUSHBUTTON_1_ID      ID_PIOE
#define PIN_PUSHBUTTON_1_TYPE    PIO_INPUT
#define PIN_PUSHBUTTON_1_ATTR    ( PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_RISE_EDGE )

/** Push button #1 definition.
 *  Attributes = pull-up + debounce + interrupt on falling edge. */
#define PUSHBUTTON_2_NAME        "RIGHT CLICK"
#define GPIO_PUSH_BUTTON_2       ( PIO_PB23_IDX )
#define GPIO_PUSH_BUTTON_2_FLAGS \
    ( PIO_INPUT | PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE )

#define PIN_PUSHBUTTON_2                  \
    { PIO_PB23, PIOB, ID_PIOB, PIO_INPUT, \
      PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE }
#define PIN_PUSHBUTTON_2_MASK    PIO_PB23
#define PIN_PUSHBUTTON_2_PIO     PIOB
#define PIN_PUSHBUTTON_2_ID      ID_PIOB
#define PIN_PUSHBUTTON_2_TYPE    PIO_INPUT
#define PIN_PUSHBUTTON_2_ATTR    ( PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE )

#define PIN_TC0_TIOA0            ( PIO_PB25_IDX )
#define PIN_TC0_TIOA0_FLAGS      ( PIO_PERIPH_B | PIO_DEFAULT )

#define PIN_TC0_TIOA1            ( PIO_PA2_IDX )
#define PIN_TC0_TIOA1_FLAGS      ( PIO_PERIPH_A | PIO_DEFAULT )

#define PIN_TC0_TIOA1_PIO        PIOA
#define PIN_TC0_TIOA1_MASK       PIO_PA2
#define PIN_TC0_TIOA1_ID         ID_PIOA
#define PIN_TC0_TIOA1_TYPE       PIO_PERIPH_A
#define PIN_TC0_TIOA1_ATTR       PIO_DEFAULT

#define PIN_TC0_TIOA2            ( PIO_PA5_IDX )
#define PIN_TC0_TIOA2_FLAGS      ( PIO_INPUT | PIO_DEFAULT )

#define PIN_TC0_TIOA2_PIO        PIOA
#define PIN_TC0_TIOA2_MASK       PIO_PA5
#define PIN_TC0_TIOA2_ID         ID_PIOA
#define PIN_TC0_TIOA2_TYPE       PIO_INPUT
#define PIN_TC0_TIOA2_ATTR       PIO_DEFAULT

/**
 * \file
 * PWMC
 * - \ref PIN_PWMC_PWMH0
 * - \ref PIN_PWMC_PWML0
 * - \ref PIN_PWMC_PWMH1
 * - \ref PIN_PWMC_PWML1
 * - \ref PIN_PWMC_PWMH2
 * - \ref PIN_PWMC_PWML2
 * - \ref PIN_PWMC_PWMH3
 * - \ref PIN_PWMC_PWML3
 * - \ref PIN_PWM_LED0
 * - \ref PIN_PWM_LED1
 * - \ref PIN_PWM_LED2
 * - \ref CHANNEL_PWM_LED0
 * - \ref CHANNEL_PWM_LED1
 * - \ref CHANNEL_PWM_LED2
 *
 */

/* ------------------------------------------------------------------------ */
/* PWM                                                                      */
/* ------------------------------------------------------------------------ */
/*! PWMC PWM0 pin definition: Output High. */
#define PIN_PWMC_PWMH0 \
    { PIO_PB12B_PWMH0, PIOB, ID_PIOB, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_PWMC_PWMH0_TRIG         PIO_PB12_IDX
#define PIN_PWMC_PWMH0_TRIG_FLAG    PIO_PERIPH_B | PIO_DEFAULT
/*! PWMC PWM0 pin definition: Output Low. */
#define PIN_PWMC_PWML0 \
    { PIO_PA21B_PWML0, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM1 pin definition: Output High. */
#define PIN_PWMC_PWMH1 \
    { PIO_PB13B_PWMH1, PIOB, ID_PIOB, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM1 pin definition: Output Low. */
#define PIN_PWMC_PWML1 \
    { PIO_PB17B_PWML1, PIOB, ID_PIOB, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM2 pin definition: Output High. */
#define PIN_PWMC_PWMH2 \
    { PIO_PA13B_PWMH2, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM2 pin definition: Output Low. */
#define PIN_PWMC_PWML2 \
    { PIO_PA20B_PWML2, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM3 pin definition: Output High. */
#define PIN_PWMC_PWMH3 \
    { PIO_PA9B_PWMH3, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWMC PWM3 pin definition: Output Low. */
#define PIN_PWMC_PWML3 \
    { PIO_PC8B_PWML3, PIOC, ID_PIOC, PIO_PERIPH_B, PIO_DEFAULT }
/*! PWM pins definition for LED0 */
#define PIN_PWM_LED0            PIN_PWMC_PWMH0, PIN_PWMC_PWML0
/*! PWM pins definition for LED1 */
#define PIN_PWM_LED1            PIN_PWMC_PWMH1, PIN_PWMC_PWML1
/*! PWM pins definition for LED2 */
#define PIN_PWM_LED2            PIN_PWMC_PWMH2, PIN_PWMC_PWML2
/*! PWM channel for LED0 */
#define CHANNEL_PWM_LED0        0
/*! PWM channel for LED1 */
#define CHANNEL_PWM_LED1        1
/*! PWM channel for LED2 */
#define CHANNEL_PWM_LED2        2

/*! PWM LED0 pin definitions. */
#define PIN_PWM_LED0_GPIO       PIO_PB13_IDX
#define PIN_PWM_LED0_FLAGS      ( PIO_PERIPH_B | PIO_DEFAULT )
#define PIN_PWM_LED0_CHANNEL    PWM_CHANNEL_1

/*! PWM LED1 pin definitions. */
#define PIN_PWM_LED1_GPIO       PIO_PB12_IDX
#define PIN_PWM_LED1_FLAGS      ( PIO_PERIPH_B | PIO_DEFAULT )
#define PIN_PWM_LED1_CHANNEL    PWM_CHANNEL_0

