FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
/*! PWM LED2 pin definitions. */
#define PIN_PWM_LED2_GPIO       PIO_PA12_IDX
#define PIN_PWM_LED2_FLAGS      ( PIO_PERIPH_B | PIO_DEFAULT )

/**
 * \file
 * SPI
 * - \ref PIN_SPI_MISO
 * - \ref PIN_SPI_MOSI
 * - \ref PIN_SPI_SPCK
 * - \ref PINS_SPI
 * - \ref PIN_SPI_NPCS0
 * - \ref PIN_SPI1_MISO
 * - \ref PIN_SPI1_MOSI
 * - \ref PIN_SPI1_SPCK
 * - \ref PINS_SPI1
 * - \ref PIN_SPI1_NPCS0
 *
 */

/* ------------------------------------------------------------------------ */
/* SPI                                                                      */
/* ------------------------------------------------------------------------ */
/*! SPI MISO pin definition. */
#define PIN_SPI0_MISO \
    { PIO_PA25A_SPI0_MISO, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI MOSI pin definition. */
#define PIN_SPI0_MOSI \
    { PIO_PA26A_SPI0_MOSI, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI SPCK pin definition. */
#define PIN_SPI0_SPCK \
    { PIO_PA27A_SPI0_SPCK, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI chip select pin definition. */
#define PIN_SPI0_NPCS0 \
    { PIO_PA28A_SPI0_NPCS0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! List of SPI pin definitions (MISO, MOSI & SPCK). */
#define PINS_SPI0                PIN_SPI0_MISO, PIN_SPI0_MOSI, PIN_SPI0_SPCK

/*! SPI0 MISO pin definition. */
#define SPI0_MISO_GPIO           ( PIO_PA25_IDX )
#define SPI0_MISO_FLAGS          ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI0 MOSI pin definition. */
#define SPI0_MOSI_GPIO           ( PIO_PA26_IDX )
#define SPI0_MOSI_FLAGS          ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI0 SPCK pin definition. */
#define SPI0_SPCK_GPIO           ( PIO_PA27_IDX )
#define SPI0_SPCK_FLAGS          ( PIO_PERIPH_A | PIO_DEFAULT )

/*! SPI0 chip select 0 pin definition. (Only one configuration is possible) */
#define SPI0_NPCS0_GPIO          ( PIO_PA28_IDX )
#define SPI0_NPCS0_FLAGS         ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI0 chip select 1 pin definition. (multiple configurations are possible) */
#define SPI0_NPCS1_PA29_GPIO     ( PIO_PA29_IDX )
#define SPI0_NPCS1_PA29_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
#define SPI0_NPCS1_PB20_GPIO     ( PIO_PB20_IDX )
#define SPI0_NPCS1_PB20_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )
/*! SPI0 chip select 2 pin definition. (multiple configurations are possible) */
#define SPI0_NPCS2_PA30_GPIO     ( PIO_PA30_IDX )
#define SPI0_NPCS2_PA30_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
#define SPI0_NPCS2_PB21_GPIO     ( PIO_PB21_IDX )
#define SPI0_NPCS2_PB21_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )
/*! SPI0 chip select 3 pin definition. (multiple configurations are possible) */
#define SPI0_NPCS3_PA31_GPIO     ( PIO_PA31_IDX )
#define SPI0_NPCS3_PA31_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
#define SPI0_NPCS3_PB23_GPIO     ( PIO_PB23_IDX )
#define SPI0_NPCS3_PB23_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )

/*! SPI1 MISO pin definition. */
#define PIN_SPI1_MISO \
    { PIO_PE28A_SPI1_MISO, PIOE, ID_PIOE, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI1 MOSI pin definition. */
#define PIN_SPI1_MOSI \
    { PIO_PE29A_SPI1_MOSI, PIOE, ID_PIOE, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI1 SPCK pin definition. */
#define PIN_SPI1_SPCK \
    { PIO_PE30A_SPI1_SPCK, PIOE, ID_PIOE, PIO_PERIPH_A, PIO_DEFAULT }
/*! SPI1 chip select pin definition. */
#define PIN_SPI1_NPCS0 \
    { PIO_PE31A_SPI1_NPCS0, PIOE, ID_PIOE, PIO_PERIPH_A, PIO_DEFAULT }
/*! List of SPI1 pin definitions (MISO, MOSI & SPCK). */
#define PINS_SPI1           PIN_SPI1_MISO, PIN_SPI1_MOSI, PIN_SPI1_SPCK

/*! SPI1 MISO pin definition. */
#define SPI1_MISO_GPIO      ( PIO_PE28_IDX )
#define SPI1_MISO_FLAGS     ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 MOSI pin definition. */
#define SPI1_MOSI_GPIO      ( PIO_PE29_IDX )
#define SPI1_MOSI_FLAGS     ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 SPCK pin definition. */
#define SPI1_SPCK_GPIO      ( PIO_PE30_IDX )
#define SPI1_SPCK_FLAGS     ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 chip select 0 pin definition. (Only one configuration is possible) */
#define SPI1_NPCS0_GPIO     ( PIO_PE31_IDX )
#define SPI1_NPCS0_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 chip select 1 pin definition. (Only one configuration is possible) */
#define SPI1_NPCS1_GPIO     ( PIO_PF0_IDX )
#define SPI1_NPCS1_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 chip select 2 pin definition. (Only one configuration is possible) */
#define SPI1_NPCS2_GPIO     ( PIO_PF1_IDX )
#define SPI1_NPCS2_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! SPI1 chip select 3 pin definition. (Only one configuration is possible) */
#define SPI1_NPCS3_GPIO     ( PIO_PF2_IDX )
#define SPI1_NPCS3_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )

/**
 * \file
 * SSC
 * - \ref PIN_SSC_TD
 * - \ref PIN_SSC_TK
 * - \ref PIN_SSC_TF
 * - \ref PINS_SSC_CODEC
 *
 */

/* ------------------------------------------------------------------------ */
/* SSC                                                                      */
/* ------------------------------------------------------------------------ */
/*! SSC pin Transmitter Data (TD) */
#define PIN_SSC_TD    { PIO_PA16B_TD, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! SSC pin Transmitter Clock (TK) */
#define PIN_SSC_TK    { PIO_PA14B_TK, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/*! SSC pin Transmitter FrameSync (TF) */
#define PIN_SSC_TF    { PIO_PA15B_TF, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }

/*! SSC pin Receiver Data (RD) */
#define PIN_SSC_RD    { PIO_PB18A_RD, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! SSC pin Receiver Clock (RK) */
#define PIN_SSC_RK    { PIO_PB19A_RK, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! SSC pin Receiver FrameSync (RF) */
#define PIN_SSC_RF    { PIO_PB17A_RF, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }

/*! SSC pins definition for codec. */
#define PINS_SSC_CODEC                  \
    PIN_SSC_TD, PIN_SSC_TK, PIN_SSC_TF, \
    PIN_SSC_RD, PIN_SSC_RK, PIN_SSC_RF

/**
 * \file
 * PCK0
 * - \ref PIN_PCK0
 *
 */

/* ------------------------------------------------------------------------ */
/* PCK                                                                      */
/* ------------------------------------------------------------------------ */
/*! PCK0 */
#define PIN_PCK0          ( PIO_PB22_IDX )
#define PIN_PCK0_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )

#define PIN_PCK_0_MASK    PIO_PB22
#define PIN_PCK_0_PIO     PIOB
#define PIN_PCK_0_ID      ID_PIOB
#define PIN_PCK_0_TYPE    PIO_PERIPH_B
#define PIN_PCK_0_ATTR    PIO_DEFAULT

/**
 * \file
 * HSMCI
 * - \ref PINS_HSMCI
 *
 */

/* ------------------------------------------------------------------------ */
/* HSMCI                                                                      */
/* ------------------------------------------------------------------------ */
/*! HSMCI pins definition. */
#define PINS_HSMCI                                                          \
    { PIO_PA20A_MCCDA | PIO_PA19A_MCCK | PIO_PA21A_MCDA0 | PIO_PA22A_MCDA1  \
      | PIO_PA23A_MCDA2 | PIO_PA24A_MCDA3,                                  \
      PIOA, ID_PIOA, PIO_PERIPH_A, PIO_PULLUP },                            \
    { PIO_PD0B_MCDA4 | PIO_PD1B_MCDA5 | PIO_PD2B_MCDA6 | PIO_PD3B_MCDA7,    \
      PIOD, ID_PIOD, PIO_PERIPH_B, PIO_PULLUP },                            \
    { PIO_PE20B_MCCDB | PIO_PE22B_MCDB0 | PIO_PE24B_MCDB1 | PIO_PE26B_MCDB2 \
      | PIO_PE27B_MCDB3,                                                    \
      PIOE, ID_PIOE, PIO_PERIPH_B, PIO_PULLUP }
/*! HSMCI pin Card Detect. */
#define PIN_HSMCI_CD    { PIO_PE6, PIOE, ID_PIOE, PIO_INPUT, PIO_PULLUP }

/**
 * \file
 * UART
 * - \ref PINS_UART
 *
 */

/* ------------------------------------------------------------------------ */
/* UART                                                                     */
/* ------------------------------------------------------------------------ */
/*! UART pins (UTXD0 and URXD0) definitions, PA8,9. */
#define PINS_UART          ( PIO_PA8A_URXD | PIO_PA9A_UTXD )
#define PINS_UART_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )

#define PINS_UART_MASK     ( PIO_PA8A_URXD | PIO_PA9A_UTXD )
#define PINS_UART_PIO      PIOA
#define PINS_UART_ID       ID_PIOA
#define PINS_UART_TYPE     PIO_PERIPH_A
#define PINS_UART_ATTR     PIO_DEFAULT

/**
 * \file
 * USART0
 * - \ref PIN_USART0_RXD
 * - \ref PIN_USART0_TXD
 * - \ref PIN_USART0_CTS
 * - \ref PIN_USART0_RTS
 * - \ref PIN_USART0_SCK
 *
 * - \ref PIN_USART0_EN
 */

/* ------------------------------------------------------------------------ */
/* USART0                                                                   */
/* ------------------------------------------------------------------------ */
/*! USART0 pin RX */
#define PIN_USART0_RXD \
    { PIO_PA10A_RXD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_RXD_IDX      ( PIO_PA10_IDX )
#define PIN_USART0_RXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART0 pin TX */
#define PIN_USART0_TXD \
    { PIO_PA11A_TXD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_TXD_IDX      ( PIO_PA11_IDX )
#define PIN_USART0_TXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART0 pin CTS */
#define PIN_USART0_CTS \
    { PIO_PB26A_CTS0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_CTS_IDX      ( PIO_PB26_IDX )
#define PIN_USART0_CTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART0 pin RTS */
#define PIN_USART0_RTS \
    { PIO_PB25A_RTS0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_RTS_IDX      ( PIO_PB25_IDX )
#define PIN_USART0_RTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART0 pin SCK */
#define PIN_USART0_SCK \
    { PIO_PA17B_SCK0, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_USART0_SCK_IDX      ( PIO_PA17_IDX )
#define PIN_USART0_SCK_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )

/*! USART0 pin ENABLE */
#define PIN_USART0_EN \
    { PIO_PE14, PIOE, ID_PIOE, PIO_OUTPUT_0, PIO_DEFAULT }
#define PIN_USART0_EN_IDX      ( PIO_PE14_IDX )
#define PIN_USART0_EN_FLAGS    ( PIO_OUTPUT_0 | PIO_DEFAULT )

/**
 * \file
 * USART1
 * - \ref PIN_USART1_RXD
 * - \ref PIN_USART1_TXD
 * - \ref PIN_USART1_CTS
 * - \ref PIN_USART1_RTS
 * - \ref PIN_USART1_SCK
 *
 */

/* ------------------------------------------------------------------------ */
/* USART1                                                                   */
/* ------------------------------------------------------------------------ */
/*! USART1 pin RX */
#define PIN_USART1_RXD \
    { PIO_PA12A_RXD1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_RXD_IDX      ( PIO_PA12_IDX )
#define PIN_USART1_RXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin TX */
#define PIN_USART1_TXD \
    { PIO_PA13A_TXD1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_TXD_IDX      ( PIO_PA13_IDX )
#define PIN_USART1_TXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin CTS */
#define PIN_USART1_CTS \
    { PIO_PA15A_CTS1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_CTS_IDX      ( PIO_PA15_IDX )
#define PIN_USART1_CTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin RTS */
#define PIN_USART1_RTS \
    { PIO_PA14A_RTS1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_RTS_IDX      ( PIO_PA14_IDX )
#define PIN_USART1_RTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin SCK */
#define PIN_USART1_SCK \
    { PIO_PA16A_SCK1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_SCK_IDX      ( PIO_PA16_IDX )
#define PIN_USART1_SCK_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )

/**
 * \file
 * USART3
 * - \ref PIN_USART3_RXD
 * - \ref PIN_USART3_TXD
 * - \ref PIN_USART3_CTS
 * - \ref PIN_USART3_RTS
 * - \ref PIN_USART3_SCK
 *
 */

/* ------------------------------------------------------------------------ */
/* USART3                                                                   */
/* ------------------------------------------------------------------------ */
/*! USART1 pin RX */
#define PIN_USART3_RXD \
    { PIO_PD5B_RXD3, PIOD, ID_PIOD, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_USART3_RXD_IDX      ( PIO_PD5_IDX )
#define PIN_USART3_RXD_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )
/*! USART1 pin TX */
#define PIN_USART3_TXD \
    { PIO_PD4B_TXD3, PIOD, ID_PIOD, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_USART3_TXD_IDX      ( PIO_PD4_IDX )
#define PIN_USART3_TXD_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )
/*! USART1 pin CTS */
#define PIN_USART3_CTS \
    { PIO_PF4A_CTS3, PIOF, ID_PIOF, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART3_CTS_IDX      ( PIO_PF4_IDX )
#define PIN_USART3_CTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin RTS */
#define PIN_USART3_RTS \
    { PIO_PF5A_RTS3, PIOF, ID_PIOF, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART3_RTS_IDX      ( PIO_PF5_IDX )
#define PIN_USART3_RTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/*! USART1 pin SCK */
#define PIN_USART3_SCK \
    { PIO_PE16B_SCK3, PIOE, ID_PIOE, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_USART3_SCK_IDX      ( PIO_PE16_IDX )
#define PIN_USART3_SCK_FLAGS    ( PIO_PERIPH_B | PIO_DEFAULT )

/**
 * \file
 * USB
 * - \ref PIN_USBOTG_VBOF
 * - \ref PIN_USB_FAULT
 *
 */

/* ------------------------------------------------------------------------ */
/* USB                                                                      */
/* ------------------------------------------------------------------------ */
/*! USB OTG VBus On/Off: Bus Power Control Port. */
#define PIN_UOTGHS_VBOF                 { PIO_PB10, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_PULLUP }
/*! USB OTG Identification: Mini Connector Identification Port. */
#define PIN_UOTGHS_ID                   { PIO_PB11, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_PULLUP }
/*! USB Fault monitoring pin definition. */
#define PIN_UOTGHS_FAULT                { PIO_PE5, PIOE, ID_PIOE, PIO_INPUT, PIO_PULLUP }

