FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
/*! Multiplexed pin used for USB ID pin: */
#define USB_ID_GPIO                     ( PIO_PB11_IDX )
#define USB_ID_FLAGS                    ( PIO_PERIPH_A | PIO_PULLUP )
/*! Multiplexed pin used for USB_VBOF: */
#define USB_VBOF_GPIO                   ( PIO_PB10_IDX )
#define USB_VBOF_FLAGS                  ( PIO_PERIPH_A | PIO_DEFAULT )
/*! Active level of the USB_VBOF output pin. */
#define USB_VBOF_ACTIVE_LEVEL           LOW
/*! USB overcurrent detection pin. */
#define USB_OVERCURRENT_DETECT_PIN      PIO_PE5_IDX
#define USB_OVERCURRENT_DETECT_GPIO     ( PIO_PE5_IDX )
#define USB_OVERCURRENT_DETECT_FLAGS    ( PIO_INPUT | PIO_PULLUP )

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_ek_usb "SAM3X-EK - USB device"
 *
 * \section Definitions
 * - \ref BOARD_USB_BMATTRIBUTES
 * - \ref CHIP_USB_UDP
 * - \ref CHIP_USB_PULLUP_INTERNAL
 * - \ref CHIP_USB_NUMENDPOINTS
 * - \ref CHIP_USB_ENDPOINTS_MAXPACKETSIZE
 * - \ref CHIP_USB_ENDPOINTS_BANKS
 */

/*! USB attributes configuration descriptor (bus or self powered, remote wakeup) */
#define BOARD_USB_BMATTRIBUTES \
    USBConfigurationDescriptor_SELFPOWERED_RWAKEUP

/*! Indicates chip has an internal pull-up. */
#define CHIP_USB_PULLUP_INTERNAL

/*! Number of USB endpoints */
#define CHIP_USB_NUMENDPOINTS    10

/*! Endpoints max packet size */
#define CHIP_USB_ENDPOINTS_MAXPACKETSIZE( i ) \
    ( ( i == 0 ) ? 64 : 1024 )

/*! Endpoints Number of Bank */
#define CHIP_USB_ENDPOINTS_BANKS( i ) \
    ( ( i == 0 ) ? 1 :                \
      ( ( i == 1 ) ? 3 :              \
        ( ( i == 2 ) ? 3 : 2 ) ) )

/**
 * \file
 * CAN
 * \ref PIN_CAN0_TRANSCEIVER_RXEN
 * \ref PIN_CAN0_TRANSCEIVER_RS
 * \ref PIN_CAN0_TXD
 * \ref PIN_CAN0_RXD
 * \ref PINS_CAN0
 *
 * \ref PIN_CAN1_TRANSCEIVER_RXEN
 * \ref PIN_CAN1_TRANSCEIVER_RS
 * \ref PIN_CAN1_TXD
 * \ref PIN_CAN1_RXD
 * \ref PINS_CAN1
 */

/* ------------------------------------------------------------------------ */
/* CAN                                                                      */
/* ------------------------------------------------------------------------ */

/*! CAN0 RXEN: Select input for high speed mode or ultra low current sleep mode */
#define PIN_CAN0_TRANSCEIVER_RXEN \
    { PIO_PB21, PIOB, ID_PIOB, PIO_OUTPUT_1, PIO_DEFAULT }

/*! CAN0 RS: Select input for high speed mode or low-current standby mode */
#define PIN_CAN0_TRANSCEIVER_RS \
    { PIO_PB20, PIOB, ID_PIOB, PIO_OUTPUT_0, PIO_DEFAULT }

/*! CAN0 TXD: Transmit data input */
#define PIN_CAN0_TXD \
    { PIO_PA0A_CANTX0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }

/*! CAN0 RXD: Receive data output */
#define PIN_CAN0_RXD \
    { PIO_PA1A_CANRX0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }

/*! List of all CAN0 definitions. */
#define PINS_CAN0               PIN_CAN0_TXD, PIN_CAN0_RXD

/** CAN0 transceiver PIN RS. */
#define PIN_CAN0_TR_RS_IDX      PIO_PB20_IDX
#define PIN_CAN0_TR_RS_FLAGS    ( PIO_TYPE_PIO_OUTPUT_0 | PIO_DEFAULT )

/** CAN0 transceiver PIN EN. */
#define PIN_CAN0_TR_EN_IDX      PIO_PB21_IDX
#define PIN_CAN0_TR_EN_FLAGS    ( PIO_TYPE_PIO_OUTPUT_0 | PIO_DEFAULT )

/** CAN0 PIN RX. */
#define PIN_CAN0_RX_IDX         ( PIO_PA1_IDX )
#define PIN_CAN0_RX_FLAGS       ( PIO_PERIPH_A | PIO_DEFAULT )

/** CAN0 PIN TX. */
#define PIN_CAN0_TX_IDX         ( PIO_PA0_IDX )
#define PIN_CAN0_TX_FLAGS       ( PIO_PERIPH_A | PIO_DEFAULT )

/*! CAN1 RXEN: Select input for high speed mode or ultra low current sleep mode */
#define PIN_CAN1_TRANSCEIVER_RXEN \
    { PIO_PE16, PIOE, ID_PIOE, PIO_OUTPUT_1, PIO_DEFAULT }

/*! CAN1 RS: Select input for high speed mode or low-current standby mode */
#define PIN_CAN1_TRANSCEIVER_RS \
    { PIO_PE15, PIOE, ID_PIOE, PIO_OUTPUT_0, PIO_DEFAULT }

/*! CAN1 TXD: Transmit data input */
#define PIN_CAN1_TXD \
    { PIO_PB14A_CANTX1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }

/*! CAN1 RXD: Receive data output */
#define PIN_CAN1_RXD \
    { PIO_PB15A_CANRX1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }

/*! List of all CAN1 definitions. */
#define PINS_CAN1               PIN_CAN1_TXD, PIN_CAN1_RXD

/** CAN1 transceiver PIN RS. */
#define PIN_CAN1_TR_RS_IDX      PIO_PE15_IDX
#define PIN_CAN1_TR_RS_FLAGS    ( PIO_TYPE_PIO_OUTPUT_0 | PIO_DEFAULT )

/** CAN1 transceiver PIN EN. */
#define PIN_CAN1_TR_EN_IDX      PIO_PE16_IDX
#define PIN_CAN1_TR_EN_FLAGS    ( PIO_TYPE_PIO_OUTPUT_0 | PIO_DEFAULT )

/** CAN1 PIN RX. */
#define PIN_CAN1_RX_IDX         ( PIO_PB15_IDX )
#define PIN_CAN1_RX_FLAGS       ( PIO_PERIPH_A | PIO_DEFAULT )

/** CAN1 PIN TX. */
#define PIN_CAN1_TX_IDX         ( PIO_PB14_IDX )
#define PIN_CAN1_TX_FLAGS       ( PIO_PERIPH_A | PIO_DEFAULT )

/**
 * \file
 * QTouch
 * PIO definitions for Slider
 * \ref SLIDER_IOMASK_SNS
 * \ref SLIDER_IOMASK_SNSK
 * \ref PINS_SLIDER_SNS
 * \ref PINS_SLIDER_SNSK
 *
 * PIO definitions for keys
 * \ref KEY_IOMASK_SNS
 * \ref KEY_IOMASK_SNSK
 * \ref PINS_KEY_SNS
 * \ref PINS_KEY_SNSK
 *
 * PIOS for QTouch
 * \ref PINS_QTOUCH
 *
 */

/* ------------------------------------------------------------------------ */
/* QTOUCH                                                                   */
/* ------------------------------------------------------------------------ */
/*! PIO definitions for Slider */
#define SLIDER_IOMASK_SNS     ( uint32_t ) ( PIO_PF0 | PIO_PF2 | PIO_PF4 )
#define SLIDER_IOMASK_SNSK    ( uint32_t ) ( PIO_PF1 | PIO_PF3 | PIO_PF5 )
#define PINS_SLIDER_SNS \
    { SLIDER_IOMASK_SNS, PIOF, ID_PIOF, PIO_INPUT, PIO_DEFAULT }
#define PINS_SLIDER_SNSK \
    { SLIDER_IOMASK_SNSK, PIOF, ID_PIOF, PIO_INPUT, PIO_DEFAULT }

/*! PIO definitions for keys */
#define KEY_IOMASK_SNS \
    ( uint32_t ) ( PIO_PE21 | PIO_PE27 | PIO_PE25 | PIO_PE19 | PIO_PE23 )
#define KEY_IOMASK_SNSK \
    ( uint32_t ) ( PIO_PE20 | PIO_PE26 | PIO_PE24 | PIO_PE18 | PIO_PE22 )
#define PINS_KEY_SNS \
    { KEY_IOMASK_SNS, PIOE, ID_PIOE, PIO_INPUT, PIO_DEFAULT }
#define PINS_KEY_SNSK \
    { KEY_IOMASK_SNSK, PIOE, ID_PIOE, PIO_INPUT, PIO_DEFAULT }

