FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
/*! PIOS for QTouch */
#define PINS_QTOUCH                    \
    PINS_SLIDER_SNS, PINS_SLIDER_SNSK, \
    PINS_KEY_SNS, PINS_KEY_SNSK

/**
 * \file
 * TWI
 * - \ref PIN_TWI_TWD0
 * - \ref PIN_TWI_TWCK0
 * - \ref PINS_TWI0
 * - \ref PIN_TWI_TWD1
 * - \ref PIN_TWI_TWCK1
 * - \ref PINS_TWI1
 *
 */

/* ------------------------------------------------------------------------ */
/* TWI                                                                      */
/* ------------------------------------------------------------------------ */
/*! TWI0 data pin */
#define PIN_TWI_TWD0 \
    { PIO_PA17A_TWD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! TWI0 clock pin */
#define PIN_TWI_TWCK0 \
    { PIO_PA18A_TWCK0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/*! TWI0 pins */
#define PINS_TWI0          PIN_TWI_TWD0, PIN_TWI_TWCK0

/*! TWI0 pins definition */
#define TWI0_DATA_GPIO     PIO_PA17_IDX
#define TWI0_DATA_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
#define TWI0_CLK_GPIO      PIO_PA18_IDX
#define TWI0_CLK_FLAGS     ( PIO_PERIPH_A | PIO_DEFAULT )

/*! TWI1 data pin */
#define PIN_TWI_TWD1 \
    { PIO_PB12A_TWD1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! TWI1 clock pin */
#define PIN_TWI_TWCK1 \
    { PIO_PB13A_TWCK1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! TWI1 pins */
#define PINS_TWI1          PIN_TWI_TWD1, PIN_TWI_TWCK1

/*! TWI1 pins definition */
#define TWI1_DATA_GPIO     PIO_PB12_IDX
#define TWI1_DATA_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
#define TWI1_CLK_GPIO      PIO_PB13_IDX
#define TWI1_CLK_FLAGS     ( PIO_PERIPH_A | PIO_DEFAULT )

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_ek_extcomp "SAM3X-EK - External components"
 * This page lists the definitions related to external on-board components
 * located in the board.h file for the SAM3X-EK.
 *
 */

/**
 * \file
 * LCD
 *
 * - \ref BOARD_LCD_PINS
 * - \ref BOARD_BACKLIGHT_PIN
 * - \ref BOARD_LCD_BASE
 * - \ref BOARD_LCD_RS
 *
 */

/*! LCD Base Address */
#define BOARD_LCD_BASE    0x62000000
/*! LCD pins definition. */
#define BOARD_LCD_PINS             \
    PIN_EBI_DATA_BUS, PIN_EBI_NRD, \
    PIN_EBI_NWE, PIN_EBI_NCS2, PIN_EBI_LCD_RS
/*! Board chip select */
#define BOARD_LCD_NCS    2
/*! Board LCD SMC setup timings */
#define BOARD_TIMING_NS( ns ) \
    ( ( ( uint32_t ) ( ( ns * ( BOARD_MCK / 1000000 ) ) / 1000 ) ) + 1 )

#define BOARD_LCD_SETUP                               \
    SMC_SETUP_NWE_SETUP( BOARD_TIMING_NS( 10 ) ) |    \
    SMC_SETUP_NCS_WR_SETUP( BOARD_TIMING_NS( 10 ) ) | \
    SMC_SETUP_NRD_SETUP( BOARD_TIMING_NS( 90 ) ) |    \
    SMC_SETUP_NCS_RD_SETUP( BOARD_TIMING_NS( 90 ) )
/*! Board LCD SMC pulse timings */
#define BOARD_LCD_PULSE                               \
    SMC_PULSE_NWE_PULSE( BOARD_TIMING_NS( 35 ) ) |    \
    SMC_PULSE_NCS_WR_PULSE( BOARD_TIMING_NS( 35 ) ) | \
    SMC_PULSE_NRD_PULSE( BOARD_TIMING_NS( 355 ) ) |   \
    SMC_PULSE_NCS_RD_PULSE( BOARD_TIMING_NS( 355 ) )
/*! Board LCD SMC cycle timings */
#define BOARD_LCD_CYCLE                             \
    SMC_CYCLE_NWE_CYCLE( BOARD_TIMING_NS( 100 ) ) | \
    SMC_CYCLE_NRD_CYCLE( BOARD_TIMING_NS( 460 ) )
/*! Board LCD SMC mode */
#define BOARD_LCD_MODE    \
    SMC_MODE_WRITE_MODE | \
    SMC_MODE_READ_MODE |  \
    SMC_MODE_DBW_BIT_16

/*! Define HX8347A register select signal. */
#define BOARD_LCD_RS                ( 1 << 1 )

/*! Backlight pin definition. */
#define BOARD_BACKLIGHT             PIO_PB27_IDX
#define BOARD_BACKLIGHT_FLAG        PIO_OUTPUT_0 | PIO_DEFAULT

/** Definition of MMA7341L x,y,z axis channel number */
#define MMA7341L_ADC_CHANNEL_X      2
#define MMA7341L_ADC_CHANNEL_Y      6
#define MMA7341L_ADC_CHANNEL_Z      7

/** MMA7341L mode set pin definition. */
#define PIN_MMA7341L_MODE           PIO_PC13_IDX
#define PIN_MMA7341L_MODE_FLAG      PIO_OUTPUT_1 | PIO_DEFAULT

/** MMA7341L X,Y,Z axis pin definition. */
#define PIN_MMA7341L_X_AXIS         PIO_PB3_IDX
#define PIN_MMA7341L_X_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT
#define PIN_MMA7341L_Y_AXIS         PIO_PC17_IDX
#define PIN_MMA7341L_Y_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT
#define PIN_MMA7341L_Z_AXIS         PIO_PC18_IDX
#define PIN_MMA7341L_Z_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT

/**
 * \file
 * TouchScreen
 *
 * - \ref PIN_TSC_IRQ
 * - \ref PIN_TSC_BUSY
 * - \ref BOARD_TSC_SPI_BASE
 * - \ref BOARD_TSC_SPI_ID
 * - \ref BOARD_TSC_SPI_PINS
 * - \ref BOARD_TSC_NPCS
 * - \ref BOARD_TSC_NPCS_PIN
 *
 */

/* ------------------------------------------------------------------------ */
/* Touchscreen                                                              */
/* ------------------------------------------------------------------------ */
/*! Touchscreen controller IRQ pin definition. */
#define PIN_TSC_IRQ           { PIO_PA31, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
/*! Touchscreen controller Busy pin definition. */
#define PIN_TSC_BUSY          { PIO_PA30, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }

/*! Base address of SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_BASE    SPI0
/*! Identifier of SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_ID      ID_SPI0
/*! Pins of the SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_PINS    PINS_SPI0
/*! Chip select connected to the touchscreen controller. */
#define BOARD_TSC_NPCS        0
/*! Chip select pin connected to the touchscreen controller. */
/* We use PIO mode for chip select to meet ADS7843's timing specification */
#define BOARD_TSC_NPCS_PIN \
    { PIO_PA28A_SPI0_NPCS0, PIOA, ID_PIOA, PIO_OUTPUT_1, PIO_PULLUP }

/**
 * \file
 * EMAC
 *
 * - BOARD_EMAC_EREFCK
 * - BOARD_EMAC_ETXEN
 * - BOARD_EMAC_ETX0
 * - BOARD_EMAC_ETX1
 * - BOARD_EMAC_ECRSDV
 * - BOARD_EMAC_ERX0
 * - BOARD_EMAC_ERX1
 * - BOARD_EMAC_ERXER
 * - BOARD_EMAC_EMDC
 * - BOARD_EMAC_EMDIO
 *
 * - BOARD_EMAC_PINS: One single define for all MACB pins
 * - BOARD_EMAC_PHY_ADDR: Phy MAC address
 * - BOARD_EMAC_MODE_RMII: Enable RMII connection with the PHY
 */

