FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
/*! EMAC pin EREFCK */
#define BOARD_EMAC_EREFCK    { PIO_PB0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ETXEN */
#define BOARD_EMAC_ETXEN \
    { PIO_PB1A_ETXEN, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ETX0 */
#define BOARD_EMAC_ETX0 \
    { PIO_PB2A_ETX0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ETX1 */
#define BOARD_EMAC_ETX1 \
    { PIO_PB3A_ETX1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ECRSDV */
#define BOARD_EMAC_ECRSDV \
    { PIO_PB4A_ECRSDV_ERXDV, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ERX0 */
#define BOARD_EMAC_ERX0 \
    { PIO_PB5A_ERX0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ERX1 */
#define BOARD_EMAC_ERX1 \
    { PIO_PB6A_ERX1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin ERXER */
#define BOARD_EMAC_ERXER \
    { PIO_PB7A_ERXER, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin EMDC */
#define BOARD_EMAC_EMDC \
    { PIO_PB8A_EMDC, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/*! EMAC pin EMDIO */
#define BOARD_EMAC_EMDIO \
    { PIO_PB9A_EMDIO, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }

/*! EMAC pins */
#define BOARD_EMAC_PINS \
    BOARD_EMAC_EREFCK,  \
    BOARD_EMAC_ETX0,    \
    BOARD_EMAC_ETX1,    \
    BOARD_EMAC_ETXEN,   \
    BOARD_EMAC_ECRSDV,  \
    BOARD_EMAC_ERX0,    \
    BOARD_EMAC_ERX1,    \
    BOARD_EMAC_ERXER,   \
    BOARD_EMAC_EMDC,    \
    BOARD_EMAC_EMDIO

#define PIN_EEMAC_EREFCK        PIO_PB0_IDX
#define PIN_EMAC_ETXEN          PIO_PB1_IDX
#define PIN_EMAC_ETX0           PIO_PB2_IDX
#define PIN_EMAC_ETX1           PIO_PB3_IDX
#define PIN_EMAC_ECRSDV         PIO_PB4_IDX
#define PIN_EMAC_ERX0           PIO_PB5_IDX
#define PIN_EMAC_ERX1           PIO_PB6_IDX
#define PIN_EMAC_ERXER          PIO_PB7_IDX
#define PIN_EMAC_EMDC           PIO_PB8_IDX
#define PIN_EMAC_EMDIO          PIO_PB9_IDX
#define PIN_EMAC_FLAGS          PIO_PERIPH_A | PIO_DEFAULT

/** EMAC PHY address */
#define BOARD_EMAC_PHY_ADDR     0
/*! EMAC RMII mode */
#define BOARD_EMAC_MODE_RMII    1

/**
 * \file
 * SD Card
 * - \ref BOARD_SD_PINS
 * - \ref BOARD_SD_PIN_CD
 *
 */

/*! HSMCI pins that shall be configured to access the SD card. */
#define BOARD_SD_PINS      PINS_HSMCI
/*! HSMCI Card Detect pin. */
#define BOARD_SD_PIN_CD    PIN_HSMCI_CD
/*! Total number of HSMCI interface */
#define BOARD_NUM_HSMCI    1

/**
 * \file
 * SmartCard
 * - \ref SMARTCARD_CONNECT_PIN
 * - \ref PIN_ISO7816_RSTMC
 * - \ref PINS_ISO7816
 *
 */

/* ------------------------------------------------------------------------ */
/* SMARTCARD                                                                */
/* ------------------------------------------------------------------------ */
/* Smartcard detection pin */
/*#define SMARTCARD_CONNECT_PIN {1 << 13, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT} */

/*/ PIN used for reset the smartcard */
#define PIN_ISO7816_RSTMC    { 1 << 11, PIOA, ID_PIOA, PIO_OUTPUT_0, PIO_DEFAULT }
/*/ Pins used for connect the smartcard */
#define PINS_ISO7816         PIN_USART1_TXD, PIN_USART1_SCK, PIN_ISO7816_RSTMC

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_ek_mem "SAM3X-EK - Memories"
 * This page lists definitions related to internal & external on-board memories.
 *
 *
 */

/**
 * \file
 * NandFlash
 * - \ref PIN_EBI_NANDOE
 * - \ref PIN_EBI_NANDWE
 * - \ref PIN_EBI_NANDCLE
 * - \ref PIN_EBI_NANDALE
 * - \ref PIN_EBI_NANDIO
 * - \ref BOARD_NF_CE_PIN
 * - \ref BOARD_NF_RB_PIN
 * - \ref PINS_NANDFLASH
 *
 */

/* ------------------------------------------------------------------------ */
/* NAND FLASH                                                               */
/* ------------------------------------------------------------------------ */
/** NandFlash pins definition: OE. */
#define PIN_EBI_NANDOE            ( PIO_PC19_IDX )
#define PIN_EBI_NANDOE_FLAGS      ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: WE. */
#define PIN_EBI_NANDWE            ( PIO_PC20_IDX )
#define PIN_EBI_NANDWE_FLAGS      ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: CLE. */
#define PIN_EBI_NANDCLE           ( PIO_PD9_IDX )
#define PIN_EBI_NANDCLE_FLAGS     ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: ALE. */
#define PIN_EBI_NANDALE           ( PIO_PD8_IDX )
#define PIN_EBI_NANDALE_FLAGS     ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: DATA. */
#define PIN_EBI_NANDIO_0          ( PIO_PC2_IDX )
#define PIN_EBI_NANDIO_0_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_1          ( PIO_PC3_IDX )
#define PIN_EBI_NANDIO_1_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_2          ( PIO_PC4_IDX )
#define PIN_EBI_NANDIO_2_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_3          ( PIO_PC5_IDX )
#define PIN_EBI_NANDIO_3_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_4          ( PIO_PC6_IDX )
#define PIN_EBI_NANDIO_4_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_5          ( PIO_PC7_IDX )
#define PIN_EBI_NANDIO_5_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_6          ( PIO_PC8_IDX )
#define PIN_EBI_NANDIO_6_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_7          ( PIO_PC9_IDX )
#define PIN_EBI_NANDIO_7_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

/** Nandflash chip enable pin definition. */
#define PIN_NF_CE_IDX             ( PIO_PA6_IDX )
#define PIN_NF_CE_FLAGS           ( PIO_PERIPH_B | PIO_PULLUP )

/** Nandflash ready/busy pin definition. */
#define PIN_NF_RB_IDX             ( PIO_PA2_IDX )
#define PIN_NF_RB_FLAGS           ( PIO_PERIPH_B | PIO_PULLUP )

/* Chip select number for nand */
#define BOARD_NAND_CS             0

/*
 * \addtopage sam3x_ek_mem
 * \section NandFlash
 * - \ref BOARD_NF_COMMAND_ADDR
 * - \ref BOARD_NF_ADDRESS_ADDR
 * - \ref BOARD_NF_DATA_ADDR
 *
 */

/* ------------------------------------------------------------------------ */
/* NAND FLASH                                                               */
/* ------------------------------------------------------------------------ */
/*! Address for transferring command bytes to the nandflash. */
#define BOARD_NF_COMMAND_ADDR               0x60400000
/*! Address for transferring address bytes to the nandflash. */
#define BOARD_NF_ADDRESS_ADDR               0x60200000
/*! Address for transferring data bytes to the nandflash. */
#define BOARD_NF_DATA_ADDR                  0x60000000
/* Bus width for NAND */
#define CONF_NF_BUSWIDTH                    8
/* SMC NFC using five address cycle */
#define CONF_NF_NEED_FIVE_ADDRESS_CYCLES    1
/* Access timing for NAND */
#define CONF_NF_SETUP_TIMING        \
    ( SMC_SETUP_NWE_SETUP( 0 )      \
      | SMC_SETUP_NCS_WR_SETUP( 0 ) \
      | SMC_SETUP_NRD_SETUP( 0 )    \
      | SMC_SETUP_NCS_RD_SETUP( 0 ) )
#define CONF_NF_PULSE_TIMING        \
    ( SMC_PULSE_NWE_PULSE( 2 )      \
      | SMC_PULSE_NCS_WR_PULSE( 3 ) \
      | SMC_PULSE_NRD_PULSE( 2 )    \
      | SMC_PULSE_NCS_RD_PULSE( 3 ) )
#define CONF_NF_CYCLE_TIMING   \
    ( SMC_CYCLE_NWE_CYCLE( 3 ) \
      | SMC_CYCLE_NRD_CYCLE( 3 ) )
#define CONF_NF_TIMING          \
    ( SMC_TIMINGS_TCLR( 1 )     \
      | SMC_TIMINGS_TADL( 6 )   \
      | SMC_TIMINGS_TAR( 4 )    \
      | SMC_TIMINGS_TRR( 2 )    \
      | SMC_TIMINGS_TWB( 9 )    \
      | SMC_TIMINGS_RBNSEL( 7 ) \
      | ( SMC_TIMINGS_NFSEL ) )
/* Support DMA */
#define CONF_NF_USE_DMA
#ifdef CONF_NF_USE_DMA
/* DMA channel used for NF */
    #define CONF_NF_DMA_CHANNEL    0
#endif

/**
 * \file
 * \section SDRAM
 * - \ref BOARD_SDRAM_SIZE
 * - \ref PIN_SDRAM
 * - \ref BOARD_SDRAM_BUSWIDTH
 *
 */

/* ------------------------------------------------------------------------ */
/* SDRAM                                                                    */
/* ------------------------------------------------------------------------ */
/*!  Board SDRAM size for MT48LC16M16A2 */
#define BOARD_SDRAM_SIZE      ( 32 * 1024 * 1024 )  /* 32 MB */

/** Address for transferring command bytes to the SDRAM. */
#define BOARD_SDRAM_ADDR      0x70000000

/**  List of all SDRAM pins definitions */
#define PIO_SDRAM_SDCKE       PIO_PD13
#define PIO_SDRAM_SDCS        PIO_PD12
#define PIO_SDRAM_RAS         PIO_PD15
#define PIO_SDRAM_CAS         PIO_PD16
#define PIO_SDRAM_BA0         PIO_PD6
#define PIO_SDRAM_BA1         PIO_PD7
#define PIO_SDRAM_SDWE        PIO_PD14
#define PIO_SDRAM_NBS0        PIO_PC21
#define PIO_SDRAM_NBS1        PIO_PD10
#define PIO_SDRAM_DATA        ( 0xffff << 2 ) /*PIO_PC2--PIO_PC17 */
#define PIO_SDRAM_SDA0_A7     ( 0xff << 23 )  /*PIO_PC23--PIO_PC30 */
#define PIO_SDRAM_SDA8        PIO_PD22
#define PIO_SDRAM_SDA9        PIO_PD23
#define PIO_SDRAM_SDA11       PIO_PD25
#define PIO_SDRAM_SDA12       PIO_PD4
#define PIO_SDRAM_SDA10       PIO_PD11

#define PIN_SDRAM_SDCKE       PIO_PD13_IDX
#define PIN_SDRAM_SDCS        PIO_PD12_IDX
#define PIN_SDRAM_RAS         PIO_PD15_IDX
#define PIN_SDRAM_CAS         PIO_PD16_IDX
#define PIN_SDRAM_BA0         PIO_PD6_IDX
#define PIN_SDRAM_BA1         PIO_PD7_IDX
#define PIN_SDRAM_SDWE        PIO_PD14_IDX
#define PIN_SDRAM_NBS0        PIO_PC21_IDX
#define PIN_SDRAM_NBS1        PIO_PD10_IDX
#define PIN_SDRAM_DATA0       PIO_PC2_IDX
#define PIN_SDRAM_DATA1       PIO_PC3_IDX
#define PIN_SDRAM_DATA2       PIO_PC4_IDX
#define PIN_SDRAM_DATA3       PIO_PC5_IDX
#define PIN_SDRAM_DATA4       PIO_PC6_IDX
#define PIN_SDRAM_DATA5       PIO_PC7_IDX
#define PIN_SDRAM_DATA6       PIO_PC8_IDX
#define PIN_SDRAM_DATA7       PIO_PC9_IDX
#define PIN_SDRAM_DATA8       PIO_PC10_IDX
#define PIN_SDRAM_DATA9       PIO_PC11_IDX
#define PIN_SDRAM_DATA10      PIO_PC12_IDX
#define PIN_SDRAM_DATA11      PIO_PC13_IDX
#define PIN_SDRAM_DATA12      PIO_PC14_IDX
#define PIN_SDRAM_DATA13      PIO_PC15_IDX
#define PIN_SDRAM_DATA14      PIO_PC16_IDX
#define PIN_SDRAM_DATA15      PIO_PC17_IDX
#define PIN_SDRAM_SDA1        PIO_PC23_IDX
#define PIN_SDRAM_SDA2        PIO_PC24_IDX
#define PIN_SDRAM_SDA3        PIO_PC25_IDX
#define PIN_SDRAM_SDA4        PIO_PC26_IDX
#define PIN_SDRAM_SDA5        PIO_PC27_IDX
#define PIN_SDRAM_SDA6        PIO_PC28_IDX
#define PIN_SDRAM_SDA7        PIO_PC29_IDX
#define PIN_SDRAM_SDA0        PIO_PC30_IDX
#define PIN_SDRAM_SDA8        PIO_PD22_IDX
#define PIN_SDRAM_SDA9        PIO_PD23_IDX
#define PIN_SDRAM_SDA11       PIO_PD25_IDX
#define PIN_SDRAM_SDA12       PIO_PD4_IDX
#define PIN_SDRAM_SDA10       PIO_PD11_IDX

#define PIN_SDRAM_FLAGS       PIO_PERIPH_A | PIO_PULLUP

#define PIN_SDRAM_EN          PIO_PD18_IDX
#define PIN_SDRAM_EN_FLAGS    PIO_OUTPUT_1 | PIO_DEFAULT

/**  List of all SDRAM pins definitions */
#define PINS_SDRAM_PIOC                                    \
    { PIO_SDRAM_DATA | PIO_SDRAM_NBS0 | PIO_SDRAM_SDA0_A7, \
      PIOC, ID_PIOC, PIO_PERIPH_A, PIO_PULLUP }

