FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3X_Atmel_Studio/src/asf/sam/boards/sam3x_ek/sam3x_ek.h
#define PINS_SDRAM_PIOD                  \
    { PIO_SDRAM_SDCKE | PIO_SDRAM_SDCS | \
      PIO_SDRAM_RAS | PIO_SDRAM_CAS |    \
      PIO_SDRAM_BA0 | PIO_SDRAM_BA1 |    \
      PIO_SDRAM_SDWE | PIO_SDRAM_NBS1 |  \
      PIO_SDRAM_SDA10 |                  \
      PIO_SDRAM_SDA8 | PIO_SDRAM_SDA9 |  \
      PIO_SDRAM_SDA11 | PIO_SDRAM_SDA12, \
      PIOD, ID_PIOD, PIO_PERIPH_A, PIO_PULLUP }

/* PIO18 is used as SDRAM Enable on EK-REVB board */
#define PINS_SDRAM_EN \
    { ( 1 << 18 ), PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT }

#define PINS_SDRAM              PINS_SDRAM_PIOC, PINS_SDRAM_PIOD, PINS_SDRAM_EN

/*!  SDRAM bus width */
#define BOARD_SDRAM_BUSWIDTH    16

/* SDRAMC clock speed */
#define SDRAMC_CLK              ( BOARD_MCK )

/**
 * \file
 * \section NorFlash
 * - \ref BOARD_NORFLASH_ADDR
 *
 */

/* ------------------------------------------------------------------------ */
/* NOR FLASH                                                                */
/* ------------------------------------------------------------------------ */
/*! Address for transferring command bytes to the norflash. */
#define BOARD_NORFLASH_ADDR    0x60000000

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_ek_chipdef "SAM3X-EK - Individual chip definition"
 * This page lists the definitions related to different chip's definition
 * located in the board.h file for the SAM3X-EK.
 *
 * \section USART
 * - \ref BOARD_PIN_USART_RXD
 * - \ref BOARD_PIN_USART_TXD
 * - \ref BOARD_PIN_USART_CTS
 * - \ref BOARD_PIN_USART_RTS
 * - \ref BOARD_PIN_USART_EN
 * - \ref BOARD_USART_BASE
 * - \ref BOARD_ID_USART
 */

/*! Rtc */
#define BOARD_RTC_ID                ID_RTC

/* AT24CXX device address */
#define BOARD_AT24C_ADDRESS         0x50
/** Define MCP980X TWI instance. */
#define BOARD_AT24C_TWI_INSTANCE    ( TWI0 )

/*! TWI ID for EEPROM application to use */
#define BOARD_ID_TWI_EEPROM         ID_TWI0
/*! TWI Base for TWI EEPROM application to use */
#define BOARD_BASE_TWI_EEPROM       TWI0
/*! TWI pins for EEPROM application to use */
#define BOARD_PINS_TWI_EEPROM       PINS_TWI0

/*! USART RX pin for application */
#define BOARD_PIN_USART_RXD         PIN_USART0_RXD
/*! USART TX pin for application */
#define BOARD_PIN_USART_TXD         PIN_USART0_TXD
/*! USART CTS pin for application */
#define BOARD_PIN_USART_CTS         PIN_USART0_CTS
/*! USART RTS pin for application */
#define BOARD_PIN_USART_RTS         PIN_USART0_RTS
/*! USART ENABLE pin for application */
#define BOARD_PIN_USART_EN          PIN_USART0_EN
/*! USART Base for application */
#define BOARD_USART_BASE            USART0
/*! USART ID for application */
#define BOARD_ID_USART              ID_USART0
/*! USART1 Base for application */
#define BOARD_USART1_BASE           USART1
/*! USART1 ID for application */
#define BOARD_ID_USART1             ID_USART1
/*! USART3 Base for application */
#define BOARD_USART3_BASE           USART3
/*! USART3 ID for application */
#define BOARD_ID_USART3             ID_USART3

#define CONSOLE_UART                UART
#define CONSOLE_UART_ID             ID_UART

/* RE pin. */
#define PIN_RE_IDX                  PIN_USART0_CTS_IDX
#define PIN_RE_FLAGS                ( PIO_OUTPUT_0 | PIO_DEFAULT )

/* IRDA SD pin. */
#define PIN_IRDA_SD_IDX             PIN_USART0_CTS_IDX
#define PIN_IRDA_SD_FLAGS           ( PIO_OUTPUT_1 | PIO_DEFAULT )

/* TXD pin configuration. */
#define PIN_USART_TXD_IDX           PIN_USART0_TXD_IDX
#define PIN_USART_TXD_FLAGS         ( PIO_PERIPH_A | PIO_DEFAULT )
#define PIN_USART_TXD_IO_FLAGS      ( PIO_OUTPUT_0 | PIO_DEFAULT )

/* ISO7816 example relate PIN definition. */
#define ISO7816_USART_ID            ID_USART0
#define ISO7816_USART               USART0
#define PIN_ISO7816_RST_IDX         PIO_PA15_IDX
#define PIN_ISO7816_RST_FLAG        ( PIO_OUTPUT_0 | PIO_DEFAULT )

#endif /* _SAM3X_EK_H_ */
